#include <stdio.h>
#include <string.h>
#include "banner.h"
#include "terminal.h"

void printCentered(const char *text) {
    int width = getTerminalWidth();

    const char *start = text;

    if (width < 95) {
        printf("LINKED LIST LIBRARY");
        return;
    }

    while (*start) {
        const char *end = strchr(start, '\n');
        int len = end ? (end - start) : strlen(start);

        int padding = (width - len) / 2;
        if (padding < 0) padding = 0;

        if (len > 0) {
            for (int i = 0; i < padding; i++) printf(" ");
            printf("%.*s\n", len, start);
        } else {
            printf("\n");
        }

        if (!end) break;
        start = end + 1;

    }
}

const char* getBanner() {
    return
    "▗▖   ▗▄▄▄▖▗▖  ▗▖▗▖ ▗▖▗▄▄▄▖▗▄▄▄      ▗▖   ▗▄▄▄▖ ▗▄▄▖▗▄▄▄▖    ▗▖   ▗▄▄▄▖▗▄▄▖ ▗▄▄▖  ▗▄▖ ▗▄▄▖▗▖  ▗▖\n"
    "▐▌     █  ▐▛▚▖▐▌▐▌▗▞▘▐▌   ▐▌  █     ▐▌     █  ▐▌     █      ▐▌     █  ▐▌ ▐▌▐▌ ▐▌▐▌ ▐▌▐▌ ▐▌▝▚▞▘ \n"
    "▐▌     █  ▐▌ ▝▜▌▐▛▚▖ ▐▛▀▀▘▐▌  █     ▐▌     █   ▝▀▚▖  █      ▐▌     █  ▐▛▀▚▖▐▛▀▚▖▐▛▀▜▌▐▛▀▚▖ ▐▌  \n"
    "▐▙▄▄▖▗▄█▄▖▐▌  ▐▌▐▌ ▐▌▐▙▄▄▖▐▙▄▄▀     ▐▙▄▄▖▗▄█▄▖▗▄▄▞▘  █      ▐▙▄▄▖▗▄█▄▖▐▙▄▞▘▐▌ ▐▌▐▌ ▐▌▐▌ ▐▌ ▐▌  \n";
}